{"/information/":{"data":{"":"\n⨝\n—"},"title":"Information"},"/information/about/":{"data":{"":"","#":" ℹ️ Article work in progress. NAIIVE is a decentralized organization operating across various fields.\nInitially, NAIIVE was established in response to the opportunities where numerous talented individuals were underappreciated, lacked connections, or had limited choices, hindering their ability to nurture and capitalize on their talents.\nOne of the challenges for clients lies in the obscurity, difficulty in locating, lack of guarantees, or doubts associated with these talents, leading to missed opportunities and deals.\nNAIIVE serves as an intermediary and a guarantor, facilitating collaboration between clients and these talents, ensuring that they can fully leverage their skills, while clients receive assurances regarding the sustainability of their projects.\nVision expand and accelerating technology adaptation for everyone. technology not just a tool for a select few but a universal resource that drives innovation, efficiency, and progress. Mission Provide straightforward solutions for seamless technology adaptation and integration. Uphold transparency and neutrality in all our opinions, discussions, and projects. Foster familiarity with technology by offering clear explanations and practical examples. "},"title":"About"},"/information/documentation/":{"data":{"":" Glossary Project Status "},"title":"Documentation"},"/information/documentation/glossary/":{"data":{"":" Decentralize: distributing control or decision-making authority away from a central entity, promoting transparency, and reducing single points of failure. streamline refers to the act of simplifying and improving a process or system by eliminating unnecessary steps. executable: file or program that can be run or executed on a computer or electronic device. Git: system that allows its user to track changes, collaborate with others, and manage software development projects efficiently. Most Known Service: GitHub Source code: Assets, resource, and human-readable text-based document written in specific programming language that serves as blueprint for how a computer program should function. Open-source: refers to software or projects where the source code is made available to the public. This means that anyone can view, modify, and distribute it. It’s like having access to the recipe for a dish, you can not only cook it but also add your own ingredients. IoT: (Internet of Things) is a network of physical objects that can collect and exchange data over the internet. It enables everyday items to communicate, share data, and make autonomous decisions. PWA: (Progressive Web Application) type of application software delivered and build for web, It is intended to work on any platform with a standards-compliant browser. you can install PWA like standard application via browser. "},"title":"Glossary"},"/information/documentation/project_status/":{"data":{"":"\rNot Started: initial status when a project has been defined but work hasn’t begun yet. Planning: This stage involves creating a project plan, defining requirements, and preparing for development. Needs Feedback: The project is waiting for feedback or approval from stakeholders. Documentation: Focusing on creating or updating project documentation. Testing: The project is in the testing phase, which can include unit testing, integration testing, and user acceptance testing. Refactoring: The project is being refactored to improve maintainability or performance. Alpha/Beta Testing: The software is being tested by a select group of users before general release. Release Candidate: The software is in its final stage of testing before being released to the public. In Progress: The development work is actively underway. On Hold: The project has been temporarily suspended but may resume in the future. Canceled: The project has been officially canceled, and no further work will be done on it. Completed: The project has been finished successfully and meets all the requirements. Delayed: The project is behind schedule, need catching up. Blocked: Work on the project is blocked by an issue or dependency. Reopened: The project was considered completed but has been reopened due to issues or new requirements. Monitoring: The project is live, and monitoring and maintenance activities are ongoing. 🟢In Progress ⭕On Hold ❌Canceled ✅Completed 🟡Delayed ⛔Blocked ⚪Reopened Ⓜ️Monitoring"},"title":"Project Status"},"/information/jobs/":{"data":{"":" ℹ️ Article work in progress. E-mail | Private 🔐\rDiscussion | Public 🌐"},"title":"Jobs"},"/information/legal/":{"data":{"":" Privacy Policy Terms and Conditions "},"title":"Legal"},"/information/legal/privacy_policy/":{"data":{"":"","#":"Effective Date: 29 October 2023\nInformation We Collect We collect information that you provide directly to us, including but not limited to your name, email address, and any other information you choose to provide when using our services.\nHow We Use Your Information We may use your information for various purposes, including but not limited to:\nProvide, maintain, and improve our services. Send you important information, such as updates and changes to our terms, conditions, and policies. Respond to your requests, comments, or questions. Monitor and analyze usage patterns and trends. Disclosure of Your Information We will not disclose your information to third parties without your consent except as outlined in this Privacy Policy.\nSecurity We take reasonable measures to help protect your personal information from loss, theft, misuse, unauthorized access, disclosure, alteration, and destruction.\nChanges to This Privacy Policy We may update our Privacy Policy from time to time. We will notify you of any changes by posting the new Privacy Policy on this page. You are advised to review this Privacy Policy periodically for any changes.\nContact Us If you have any questions about this Privacy Policy, please contact us at naiive@email.com."},"title":"Privacy Policy"},"/information/legal/term_and_condition/":{"data":{"":"","#":"Acceptance of Terms By accessing or using this website, you agree to be bound by these Terms and Conditions.\nUse of Content Unless otherwise specified, all materials on this site are the property of NAIIVE and are protected by copyright and other applicable laws.\nPrivacy Policy By using our website, you acknowledge and agree to our Privacy Policy, which is an integral part of these Terms and Conditions.\nUser Conduct When using our website, you agree not to engage in any of the following activities: (a) violating any applicable laws; (b) posting offensive or harmful content; (c) attempting to access restricted areas without authorization.\nChanges to Terms We may revise and update these Terms and Conditions at any time. You are encouraged to review this page periodically for any changes.\nContact Information If you have any questions about these Terms and Conditions, please contact us at naiive@email.com."},"title":"Terms and Conditions"},"/information/partnership/":{"data":{"":" ℹ️ Article work in progress. E-mail | Private 🔐\rDiscussion | Public 🌐"},"title":"Partnership"},"/information/sponsor/":{"data":{"":" ℹ️ Article work in progress. E-mail | Private 🔐\rDiscussion | Public 🌐"},"title":"Sponsor"},"/projects/":{"data":{"":"Explore a wide range of contents that we’ve poured our ❤️ into\nAssetsdigital resources Automationoptimize repetitive or complex tasks Applicationuser-facing programs Video Gameinteractive media Request project ▶️"},"title":"Projects"},"/projects/application/":{"data":{"":"\nRequest from services ▶️\rgd.xgame engine ↗️ AISEimage generator \u0026 manipulator Motive🟢 In Progress | NAIIVE hub "},"title":"Application"},"/projects/application/aise/":{"data":{"":"MotiveFeaturesStatusResult AISE is a software built using gd.x, offering users a suite of tools for image creation and modification. designed as a mobile application, its inception aimed to integrate cutting-edge artificial intelligence technology.\nMotivation AISE was initially constructed within a limited timeframe, with a maximum duration of one day. The primary objective was to swiftly incorporate state-of-the-art Artificial Intelligence technology for proof of concept and as a fundamental exercise in mobile device design.\nSubsequently, as development progressed and further research was conducted, the decision was made to expand its functionality into a fully functional tool accessible for everyone.\nProblem While Artificial Image Generators have become more accessible to the general public, it remains evident that using such programs can still be costly. Users typically need a powerful GPU or must invest financially to make the software truly “usable.” Even when users can access it for free, there’s often a trade-off, such as watching ads or providing their data for undisclosed purposes.\nThis practice is understandable because developers incur significant expenses in operating Artificial Intelligence systems. These costs include not only bandwidth and electricity but also infrastructure maintenance. Moreover, serving hundreds of thousands, if not millions, of requests daily further compounds the financial challenges.\nℹ️ Article work in progress. AISE use AI Horde a crowd sourced distributed cluster of Image generation workers and text generation workers. if you like consider joining the horde yourself!\nStable Diffusion Served by AI Horde Models Text to Image Image to Image ControlNet Tiling \u0026 More LoRA by Civit AI Style Prompt injection using CheatSheet image editing sketch Discovery gallery Reporting Tool Version Checking Text Translation Google Translate API Image Optimization Resmush API platform status type resource note Itch.io ✅ marketplace website - Android ✅Ⓜ️ target installer apk apk - IOS ⛔ target - req x-code or CI/CD Windows ✅Ⓜ️ testing portable exe zip - MacOS ✅❌ testing portable 64 zip req notarized Linux ✅Ⓜ️ testing portable x86_64 zip - PWA ⛔ testing HTML5 page req cross-origin status definition ▶️ 🟢In Progress ⭕On Hold ❌Canceled ✅Completed 🟡Delayed ⛔Blocked ⚪Reopened Ⓜ️Monitoring name type description stable_horde_api new resources stable horde APIs wrapper with helper class, it has resume method that will try to retrieve the last known task texture_showcase new .tscn iterate \u0026 animate part / position from atlas texture. texture_dock new HTTPRequest optimize, download, cached image from internet in batch and assign it to the requested node. google_translate_api new HTTPRequest google translate APIs Wrapper, contain necessary helper. file_panel .tscn add touchscreen support theme resources add shadow, consistency adjustment "},"title":"AISE"},"/projects/assets/":{"data":{"":"\nRequest from services ▶️\r(⓿_⓿)coming soon "},"title":"Assets"},"/projects/automation/":{"data":{"":"\nRequest from services ▶️\rExe-Cute!Image optimization, executable editor \u0026 compressor, media player ↗️ "},"title":"Automation"},"/projects/video_game/":{"data":{"":"\nRequest from services ▶️\rFiksi⭕ On Hold | Action RPG "},"title":"Video Game"},"/services/":{"data":{"":"","solution#Solution":"Technology is no longer an expensive or inaccessible resource. Unfortunately, this accessibility primarily benefits individuals or companies already established in the field.\nFor the majority of individuals or businesses, technology remains unfamiliar and out of reach. Yet, it’s undeniable that technology play a crucial role in accelerating growth, enhancing efficiency, and ensuring survival.\nSolution We aim to bridge this gap by offering technology-related services solutions.\nAssetsdigital resources Automationoptimize repetitive or complex tasks Applicationuser-facing programs Video Gameinteractive media Through our services, we aspire to spare individuals or companies the need to hire a full-time development team for technology adaptation. This is further facilitated by our prebuilt solutions, which will significantly reduce development time and costs for clients.\nIn comparison to other service providers, we provide a more cost-effective and dependable solution.\nExplore projects ▶️"},"title":"Services"},"/services/application/":{"data":{"":"A type of software program that interacts directly with the end user to help perform specific tasks or functions."},"title":"Application"},"/services/application/getting_started/":{"data":{"":"","#":"we offer several levels of application services, allowing you to select the path that best aligns with your specific needs.\nImmediate in Projects / application ↗ you can explore our existing suite of applications, These tools are readily available for immediate use.\nPredefined in Predefined ↗ we’ve set up predefined projects that can minimize development costs, like a foundation it still can be tailored to your needs.\nRequest in Request ↗ we will assess your needs and develop application specifically for you. This process requires detailed requirement weather by filing our form or engaging in direct interaction with our team."},"title":"Getting Started"},"/services/application/predefined/":{"data":{"":" Virtual TourA panoramic view of an existing or conceptual place "},"title":"Predefined"},"/services/application/predefined/virtual_tour/":{"data":{"":" ⚠️ this service only available in Indonesia, you can apply / request this service to be available in your country. Virtual Tour identik dengan luxury / membingungkan dimana hanya sebagian perusahaan ataupun individu yang dapat memanfaatkannya.\nkami menawarkan jasa pengembangan virtual tour baik dalam bentuk jasa maupun pembuatan software untuk berbagai platform yang dapat bersaing baik dari segi harga, kualitas, support, juga fleksibilitas.\nberikut beberapa layanan dengan poin perbedaan dengan jasa yang kami tawarkan tanpa pengulangan poin yang di sampaikan :\nopen-source Virtual Tour kami menawarkan jasa pembuatan aplikasi baik menggunakan teknologi yang kami kembangkan maupun teknologi thirdparty. layanan-layanan Virtual Tour gratis layanan kami bersifat ekslusif, client menjadi pemilik aplikasi yang telah dibuat. kami turut membantu maupun mengelola virtual Tour. tidak ada biaya bulanan. tidak ada Server Down ataupun penonaktif-an layanan. layanan lainnya : Bing | Google | Playstore | Appstore kami menawarkan layanan yang bersaing baik dari segi harga, kualitas, support, maupun fleksibilitas. untuk hal-hal yang tidak tercantum maupun perbandingan lebih detail, silahkan gunakan media di bawah. kami akan merespon secara netral dan mencoba memberikan rekomendasi terbaik sesuai dengan kebutuhan client. E-mail | Private 🔐\rDiscussion | Public 🌐"},"title":"Virtual Tour"},"/services/application/predefined/virtual_tour/demo/":{"data":{"":" ℹ️ Article work in progress. request demo : naiive@email.com"},"title":"Demo"},"/services/application/predefined/virtual_tour/features/":{"data":{"":"","#":" 360 view Virtual Reality Resource list menggunakan Sensor Perangkat Touch / manual / auto control Info window menampilkan feed (seperti blog) pengaturan bahasa internet syncronization client dapat merubah resource, keterangan, maupun alamat-alamat dengan mudah tanpa melakukan perubahan pada aplikasi yang telah terpasang pada suatu perangkat. client dapat mengaktifkan / nonaktifkan aplikasi kapan saja. aplikasi bersifat modular, dan dapat di perbaharui dalam aplikasi, hal ini memperkecil peluang perlunya costumer mendownload / install ulang aplikasi yang telah terpasang saat ada perubahan pada aplikasi. bahasa Inggris / Indonesia penyesuaian / revisi ringan gratis selaman 30 kali atau 1 tahun Tambahan Indikator ruang 3D\nukuran objek (panjang, lebar, tinggi) poin of interest Deskripsi (dengan system feed seperti Info window) image viewer Hotspot / warp (untuk pindah ruangan) gallery\nmenampilkan gambar-gambar non 360 360 image viewer untuk gambar external Security\nconditional access code file base access key bahasa tambahan apapun\nSpesifik client dapat mengajukan fitur spesifik apapun E-mail | Private 🔐\rDiscussion | Public 🌐"},"title":"Fitur"},"/services/application/predefined/virtual_tour/procedures/":{"data":{"":"kami bersifat fleksible dalam proses diskusi / pengembangan / pengelolaan, client tidak di haruskan mengikuti tahap-tahap selama memiliki kesepahaman, adapun tahap-tahap yang mungkin terjadi sebagai berikut :\ndiskusi proyek melalui media yang tersedia diskusi detail (D, C) (optional) proposal (C) (optional) design document (C) tahap pertimbangan \u0026 perencanaan (D, C) pengambilan sumber (D) (additional) pembuatan gambar teknis (Floorplan) (D / C) (additional) pengambilan gambar (D / C) produksi (D) pembuatan aplikasi (D) Testing / QC / QA (D, C) revisi / penyesuaian (D, C) rilis (D, C) maintanence (D, C) E-mail | Private 🔐\rDiscussion | Public 🌐"},"title":"Prosedur"},"/services/application/predefined/virtual_tour/qna/":{"data":{"":" apakah source code termasuk dalam paket pembelian? ya, jika aplikasi menggunakan teknologi thidparty. tidak, jika software menggunakan teknologi yang kami kembangkan, source code hanya akan di berikan pada kesepakatan tertentu. berapa biaya pada suatu proyek dari awal hingga selesai? biaya proyek akan di sesuaikan dengan budget yang client ajukan dan diskusikan. apakan penyesuainan / revisi membutuhkan biaya tambahan? revisi maupun penyesuaian ringan gratis selama 1 tahun / 30 kali revisi maupun penyesuaian lainnya akan menyesuaikan dengan budget yang client ajukan apakah aplikasi akan tetap di support setelah poyek selesai? bug fix dan improvement akan terus di berikan modul-modul inti akan tetap di support selama memungkinkan apakah aplikasi dapat di tambah / kurangi / modifikasi setelah kontrak / aplikasi selesai? ya, client dapat meminta perubahan kapanpun setelah aplikasi selesai. apakan biaya porting (adaptasi software untuk sistem operasi lain) akan sama dengan biaya awal pembuatan aplikasi? tidak, biaya akan menyesuaikan dengan seberapa banyak penyesuaian yang di perlukan, bergantung seberapa kompleks penyesuaiannya, porting dapat di berikan secara gratis. platform apa saja yang di support oleh poyek ini? Windows, MacOS, Linux, IOS, Android, Website, Progressive Web App apakah biaya sudah termasuk dengan biaya marketplace / hosting (ex : playstore, appstore, website, dll): tidak, kami memberikan project executable yang selanjutnya client dapat memasukkannya ke marketplace / website manapun, jika di perlukan kami akan membantu proses-prosesnya. faktor apa yang membedakan biaya layanan ini di banding layanan lain? kami tidak / belum mengutamakan keuntungan. proyek di kerjakan oleh 1-3 multifungsi team / personal. QA / QC / Testing bersifat internal. client dapat merekrut thirdparty untuk membantu. E-mail | Private 🔐\rDiscussion | Public 🌐"},"title":"Pertanyaan"},"/services/application/qna/":{"data":{"":" ℹ️ Article work in progress. E-mail | Private 🔐\rDiscussion | Public 🌐"},"title":"QnA"},"/services/application/request/":{"data":{"":" ℹ️ If you wish to confirm whether your request can be fulfilled before filling out this form, please contact our support team or initiate a discussion. Terms and Conditions\rBy submitting this form, you agree to the following terms and conditions:\rYou agree to provide accurate and truthful information in this form.\rYou understand that the information you provide will be used to process your service request.\rYou agree to our privacy policy and how your data will be handled.\rYou understand that the submission of this form does not guarantee the provision of services and is subject to review.\rPlease review our full terms and conditions and privacy policy on our website for more details. If you have any questions or concerns, please contact our support team or initiate a discussion.\n* Name\r* Email\rCompany Name\rProject Name\r* Project Overview\r* Project Goals and Objectives\r* Project Features and Functionality\r* Development Platform\rWindows\rMacOS\rLinux\rAndroid / Chromebook\r* Base Target Platform\rWindows\rMacOS\rLinux\rWeb (PWA)\rChromebook\rAndroid\rIOS\rAugmented Reality\rVirtual Reality\r* Target Platforms\rWindows\rMacOS\rLinux\rChromebook\rAndroid\rIOS\rWeb (PWA)\rAugmented Reality\rVirtual Reality\rNintendo Switch\rPlaystation\rXBox\r* Maintenance and Support\rNone\rPartial\rFull\rBudget (USD)\rExpected Completion Date\rAttach Files (if any)\rAdditional Comments\rI agree to the Terms and Conditions\r( * ): Required Development Platform: to ensure compatibility of the technology is available for your platform. Base Target Platform: the main platform for testing during the development process. Maintenance and Support: this applies after the project is completed. None: We will not involved in maintenance and support. Partial: We will provide partial maintenance and support. (No routine) Full: We will provide full maintenance and support. "},"title":"Request"},"/services/assets/":{"data":{"":"\nGet from projects ▶️\r(●'◡'●)coming soon "},"title":"Assets"},"/services/automation/":{"data":{"":"","advantages#Advantages":"","disadvantages#Disadvantages":"Automation is technologies that reduce human intervention in processes by predetermining decision criteria, subprocess relationships, and related actions.\nAdvantages ℹ️ automation is associated with faster production and cheaper labor costs. it could replaces hard, physical, or monotonous work. Increased consistency, accuracy, predictability Improved quality, productivity Reduced cycle time, labor costs, expenses Relieving of monotonously repetitive work Disadvantages 🚫 not all tasks can be automated, and some tasks are more expensive to automate than others. can be complex to maintain. without human oversight, automation may result unchecked defects. Over-reliance on automation can result in vulnerabilities if systems fail or are compromised. In certain industries, automation may lead to depersonalization of products and services, diminishing the uniqueness and personal touch. "},"title":"Automation"},"/services/automation/getting_started/":{"data":{"":"","#":"we offer several levels of automation services, allowing you to select the path that best aligns with your specific needs.\nImmediate in Projects / Automation ↗ you can explore our existing suite of automation tools, These tools are readily available for immediate use.\nPredefined in Predefined ↗ we’ve set up predefined automation projects that can minimize development costs, like a foundation it still can tailor solutions to your needs.\nRequest in Request ↗ we will assess your needs and develop tools specifically for you. This process requires detailed requirement weather by filing our form or engaging in direct interaction with our team.\nWe can automating a broad range of tasks from document to artistic works.\nℹ️ By choosing the appropriate level, you can achieve your goals efficiently. "},"title":"Getting Started"},"/services/automation/predefined/":{"data":{"":" ᕦ(ò_óˇ)ᕤcoming soon "},"title":"Predefined"},"/services/automation/qna/":{"data":{"":" ℹ️ Article work in progress. E-mail | Private 🔐\rDiscussion | Public 🌐"},"title":"QnA"},"/services/automation/request/":{"data":{"":" ℹ️ If you wish to confirm whether your request can be fulfilled before filling out this form, please contact our support team or initiate a discussion. Terms and Conditions\rBy submitting this form, you agree to the following terms and conditions:\rYou agree to provide accurate and truthful information in this form.\rYou understand that the information you provide will be used to process your service request.\rYou agree to our privacy policy and how your data will be handled.\rYou understand that the submission of this form does not guarantee the provision of services and is subject to review.\rPlease review our full terms and conditions and privacy policy on our website for more details. If you have any questions or concerns, please contact our support team or initiate a discussion.\n* Name\r* Email\r* Task / Goals / Objectives\rPreferences\rI'm familiar with Script\rI'm familiar with Command Line\rBudget (USD)\rExpected Completion Date\rAdditional Comments\rI agree to the Terms and Conditions"},"title":"Request"},"/services/video_game/":{"data":{"":"A type of software program that involves interaction with user to complete objectives or challenges, often with visual, rules, and audio elements. it has various genres and styles for entertainment, engagement, or educational purpose.\nℹ️ Article work in progress. ⚠️ Due to our current limitations, we will only accept the most feasible requests. For this reason, it is recommended that you engaging in direct interaction with our team first. E-mail | Private 🔐\rDiscussion | Public 🌐"},"title":"Video Game"},"/services/workflow/":{"data":{"":" ℹ️ Article work in progress. E-mail | Private 🔐\rDiscussion | Public 🌐"},"title":"Workflow"}}