{"/information/":{"data":{"":" About Jobs Partnership "},"title":"Information"},"/information/about/":{"data":{"":"","#":" ℹ️ Article work in progress. NAIIVE is a decentralized organization operating across various fields.\nInitially, NAIIVE was established in response to the opportunities where numerous talented individuals were underappreciated, lacked connections, or had limited choices, hindering their ability to nurture and capitalize on their talents.\nOne of the challenges for clients lies in the obscurity, difficulty in locating, lack of guarantees, or doubts associated with these talents, leading to missed opportunities and deals.\nNAIIVE serves as an intermediary and a guarantor, facilitating collaboration between clients and these talents, ensuring that they can fully leverage their skills, while clients receive assurances regarding the sustainability of their projects.\nVision expand and accelerating technology adaptation for everyone. technology not just a tool for a select few but a universal resource that drives innovation, efficiency, and progress. Mission Provide straightforward solutions for seamless technology adaptation and integration. Uphold transparency and neutrality in all our opinions, discussions, and projects. Foster familiarity with technology by offering clear explanations and practical examples. "},"title":"About"},"/information/jobs/":{"data":{"":" ℹ️ Article work in progress. Email | Discussion\n"},"title":"Jobs"},"/information/partnership/":{"data":{"":" ℹ️ Article work in progress. Email | Discussion\n"},"title":"Partnership"},"/information/website/":{"data":{"":"Explore a wide range of contents that we\u0026rsquo;ve poured our ❤️ into to create an environment that caters to your needs.\nTo acquaint visitors with documents and technical descriptions commonly encountered during technology adaptation, this website is intentionally designed to resemble documentation. Additionally, we aim to enhance visitor navigation across all content on the website with this design.\npowered by HUGO x Hextra\n"},"title":"Website"},"/projects/":{"data":{"":" Assetsdigital resources Automationreplace repetitive work Applicationuser-facing programs Video Gameinteractive media "},"title":"Projects"},"/projects/application/":{"data":{"":" AISEImage generator \u0026amp; Manipulator "},"title":"Application"},"/projects/application/aise/":{"data":{"":"","detail#Detail":"AISE is a software built using gd.x, offering users a suite of tools for image creation and modification. designed as a mobile application, its inception aimed to integrate cutting-edge artificial intelligence technology.\nMotivation AISE was initially constructed within a limited timeframe, with a maximum duration of one day. The primary objective was to swiftly incorporate state-of-the-art Artificial Intelligence technology for proof of concept and as a fundamental exercise in mobile device design.\nSubsequently, as development progressed and further research was conducted, the decision was made to expand its functionality into a fully functional tool accessible for everyone.\nProblem While Artificial Image Generators have become more accessible to the general public, it remains evident that using such programs can still be costly. Users typically need a powerful GPU or must invest financially to make the software truly \u0026ldquo;usable.\u0026rdquo; Even when users can access it for free, there\u0026rsquo;s often a trade-off, such as watching ads or providing their data for undisclosed purposes.\nThis practice is understandable because developers incur significant expenses in operating Artificial Intelligence systems. These costs include not only bandwidth and electricity but also infrastructure maintenance. Moreover, serving hundreds of thousands, if not millions, of requests daily further compounds the financial challenges.\nℹ️ Article work in progress. AISE use AI Horde a crowd sourced distributed cluster of Image generation workers and text generation workers. if you like consider joining the horde yourself!\nDetail Features Stable Diffusion Served by AI Horde Models Text to Image Image to Image ControlNet Tiling \u0026amp; More LoRA by Civit AI Style Prompt injection using CheatSheet image editing sketch Discovery gallery Reporting Tool Version Checking Text Translation Google Translate API Image Optimization Resmush API Resources url type description Itch.io page, HTML5 executable \u0026amp; more user friendly explanation Android installer as apk target platform IOS N/A target platform Windows portable as exe in zip for testing, main development operating system MacOS unknown as zip for testing, untested / reported Linux portable as x86_64 in zip for testing, untested / reported Report from developing AISE we create \u0026amp; introduce some new and refined component \u0026amp; class we can share and utilize in the future\nname type description stable_horde_api resources stable horde APIs wrapper with helper class, it has resume method that will try to retrieve the last known task texture_showcase .tscn iterate \u0026amp; animate part / position from atlas texture. texture_dock HTTPRequest optimize, download, cached image from internet in batch and assign it to the requested node. google_translate_api HTTPRequest google translate APIs Wrapper, contain necessary helper. name description file_panel cleaned up, \u0026amp; add touchscreen support theme cleaned up, add shadow, consistency adjustment ","motivation#Motivation":""},"title":"AISE"},"/projects/assets/":{"data":{"":" ⚠️ Coming Soon. "},"title":"Assets"},"/projects/automation/":{"data":{"":" ⚠️ Coming Soon. "},"title":"Automation"},"/projects/video_game/":{"data":{"":" ⚠️ Coming Soon. "},"title":"Video Game"},"/services/":{"data":{"":"","problem#Problem":"","solution#Solution":"Technology is no longer an expensive or inaccessible resource. Unfortunately, this accessibility primarily benefits individuals or companies already established in the field.\nProblem For the majority of individuals or businesses, technology remains unfamiliar and out of reach. Yet, it’s undeniable that technology play a crucial role in accelerating growth, enhancing efficiency, and ensuring survival.\nSolution We aim to bridge this gap by offering technology-related services solutions.\nThrough our services, we aspire to spare individuals or companies the need to hire a full-time development team for technology adaptation. This is further facilitated by our prebuilt solutions, which will significantly reduce development time and costs for clients.\nAssetsdigital resources Automationreplace repetitive work Applicationuser-facing programs Video Gameinteractive media In comparison to other service providers, we provide a more cost-effective and dependable solution.\n"},"title":"Services"},"/services/application/":{"data":{"":"A type of software program that interacts directly with the end user to help perform specific tasks or functions.\n"},"title":"Application"},"/services/application/getting_started/":{"data":{"":"","#":"we offer several levels of application services, allowing you to select the path that best aligns with your specific needs.\nImmediate in Projects / application ↗ you can explore our existing suite of applications, These tools are readily available for immediate use.\nPredefined in Predefined ↗ we\u0026rsquo;ve set up predefined projects that can minimize development costs, like a foundation it still can be tailored to your needs.\nRequest in Request ↗ we will assess your needs and develop application specifically for you. This process requires detailed requirement weather by filing our form or engaging in direct interaction with our team.\n"},"title":"Getting Started"},"/services/application/predefined/":{"data":{"":" Virtual TourA panoramic view of an existing or conceptual place "},"title":"Predefined"},"/services/application/predefined/virtual_tour/":{"data":{"":" ⚠️ this service only available in Indonesia, you can apply / request this service to be available in your country. Aplikasi Virtual Tour identik dengan luxury / membingungkan dimana hanya sebagian perusahaan / individu yang dapat memanfaatkannya, kami menawarkan jasa pengembangan / pembuatan virtual tour baik dalam bentuk jasa maupun pembuatan software untuk berbagai platform, yang dapat bersaing baik dari segi harga, kualitas, support, juga fleksibilitas.\ndi rekomendasikan untuk melihat layanan-layanan yang telah tersedia, berikut beberapa layanan dengan poin perbedaan dengan jasa yang kami tawarkan tanpa pengulangan poin yang di sampaikan :\nopen-source Virtual Tour kami menawarkan jasa pembuatan aplikasi baik menggunakan teknologi yang kami kembangkan maupun teknologi thirdparty. layanan-layanan Virtual Tour gratis layanan kami bersifat ekslusif, client menjadi pemilik aplikasi yang telah dibuat. kami turut membantu maupun mengelola virtual Tour. tidak ada biaya bulanan. tidak ada Server Down ataupun penonaktif-an layanan. layanan lainnya : Bing | Google | Playstore | Appstore kami menawarkan layanan yang bersaing baik dari segi harga, kualitas, support, maupun fleksibilitas. untuk hal-hal yang tidak tercantum maupun perbandingan lebih detail, silahkan hubungi WA kami akan merespon secara netral dan mencoba memberikan rekomendasi terbaik sesuai dengan kebutuhan client. "},"title":"Virtual Tour"},"/services/application/predefined/virtual_tour/demo/":{"data":{"":" ℹ️ Article work in progress. request demo : naiive@email.com\n"},"title":"Demo"},"/services/application/predefined/virtual_tour/features/":{"data":{"":"","#":" 360 view Virtual Reality Resource list menggunakan Sensor Perangkat Touch / manual / auto control Info window menampilkan feed (seperti blog) pengaturan bahasa internet syncronization client dapat merubah resource, keterangan, maupun alamat-alamat dengan mudah tanpa melakukan perubahan pada aplikasi yang telah terpasang pada suatu perangkat. client dapat mengaktifkan / nonaktifkan aplikasi kapan saja. aplikasi bersifat modular, dan dapat di perbaharui dalam aplikasi, hal ini memperkecil peluang perlunya costumer mendownload / install ulang aplikasi yang telah terpasang saat ada perubahan pada aplikasi. bahasa Inggris / Indonesia penyesuaian / revisi ringan gratis selaman 30 kali atau 1 tahun Tambahan Indikator ruang 3D\nukuran objek (panjang, lebar, tinggi) poin of interest Deskripsi (dengan system feed seperti Info window) image viewer Hotspot / warp (untuk pindah ruangan) gallery\nmenampilkan gambar-gambar non 360 360 image viewer untuk gambar external Security\nconditional access code file base access key bahasa tambahan apapun\nSpesifik client dapat mengajukan fitur spesifik apapun "},"title":"Fitur"},"/services/application/predefined/virtual_tour/procedures/":{"data":{"":"kami bersifat fleksible dalam proses diskusi / pengembangan / pengelolaan, client tidak di haruskan mengikuti tahap-tahap selama ada kesepakatan, adapun tahap-tahap yang mungkin terjadi sebagai berikut :\ndiskusi proyek melalui media yang tersedia diskusi detail (D, C) (optional) proposal (C) (optional) design document (C) tahap pertimbangan \u0026amp; perencanaan (D, C) pengambilan sumber (D) (additional) pembuatan gambar teknis (Floorplan) (D / C / T) (additional) pengambilan gambar (D / C / T) produksi (D) pembuatan aplikasi (D) Testing / QC / QA (D, C / T) revisi / penyesuaian (D, C / T) rilis (D, C) maintanence (D, C) *pihak terlibat ( D : Developer | C : Client | T : ThirdParty )\nWhatsapp / Email\n"},"title":"Prosedur"},"/services/application/predefined/virtual_tour/qna/":{"data":{"":" apakah source code termasuk dalam paket pembelian?\nya, jika aplikasi menggunakan teknologi thidparty. tidak, jika software menggunakan teknologi yang kami kembangkan, source code hanya akan di berikan pada kesepakatan tertentu. berapa biaya pada suatu proyek dari awal hingga selesai?\nbiaya awal Rp.500.000 *[a], yang selanjutnya biaya proyek akan di sesuaikan dengan budget yang client ajukan dan diskusikan. apakan penyesuainan / revisi membutuhkan biaya tambahan?\nrevisi maupun penyesuaian ringan gratis selama 1 tahun / 30 kali revisi maupun penyesuaian lainnya akan menyesuaikan dengan budget yang client ajukan apakah aplikasi akan tetap di support setelah poyek selesai?\nbug fix dan improvement akan terus di berikan modul-modul inti akan tetap di support selama memungkinkan apakah aplikasi dapat di tambah / kurangi / modifikasi setelah kontrak / aplikasi selesai?\nya, client dapat meminta perubahan kapanpun setelah aplikasi selesai. apakan biaya porting (adaptasi software untuk sistem operasi lain) akan sama dengan biaya awal pembuatan aplikasi?\ntidak, biaya akan menyesuaikan dengan seberapa banyak penyesuaian yang di perlukan, bergantung seberapa kompleks penyesuaiannya, porting dapat di berikan secara gratis. platform apa saja yang di support oleh poyek ini?\nWindows, MacOS, Linux, IOS, Android, Website apakah biaya sudah termasuk dengan biaya marketplace / hosting (ex : playstore, appstore, website, dll):\ntidak, kami memberikan project binary yang selanjutnya client dapat memasukkannya ke marketplace / website manapun, jika di perlukan kami akan membantu proses-prosesnya. faktor apa yang membuat biaya layanan ini sangat murah di banding layanan lain?\nkami tidak / belum mengutamakan keuntungan. proyek di kerjakan oleh 1-3 multifungsi team / personal. QA / QC / Testing bersifat internal. client dapat merekrut thirdparty untuk membantu. [a] Biaya akan selalu di update menyesuaikan dengan tingkat kedewasaan teknologi yang kami kembangkan.\n"},"title":"Pertanyaan"},"/services/application/request/":{"data":{"":" ℹ️ Article work in progress. ⚠️ Due to our current limitations, we will only accept the most feasible requests. For this reason, it is recommended that you engaging in direct interaction with our team first. Email | Discussion\n"},"title":"Request"},"/services/application/request/procedures/":{"data":{"":" ℹ️ Article work in progress. Email | Discussion\n"},"title":"Procedures"},"/services/application/request/qna/":{"data":{"":" ℹ️ Article work in progress. Email | Discussion\n"},"title":"QnA"},"/services/assets/":{"data":{"":" ⚠️ Coming Soon. "},"title":"Assets"},"/services/automation/":{"data":{"":"","advantages#Advantages":"","disadvantages#Disadvantages":"Automation is technologies that reduce human intervention in processes by predetermining decision criteria, subprocess relationships, and related actions.\nAdvantages ℹ️ automation is associated with faster production and cheaper labor costs. it could replaces hard, physical, or monotonous work. Increased consistency, accuracy, predictability Improved quality, productivity Reduced cycle time, labor costs, expenses Relieving of monotonously repetitive work Disadvantages 🚫 not all tasks can be automated, and some tasks are more expensive to automate than others. can be complex to maintain. without human oversight, automation may result unchecked defects. Over-reliance on automation can result in vulnerabilities if systems fail or are compromised. In certain industries, automation may lead to depersonalization of products and services, diminishing the uniqueness and personal touch. "},"title":"Automation"},"/services/automation/getting_started/":{"data":{"":"","#":"we offer several levels of automation services, allowing you to select the path that best aligns with your specific needs.\nImmediate in Projects / Automation ↗ you can explore our existing suite of automation tools, These tools are readily available for immediate use.\nPredefined in Predefined ↗ we\u0026rsquo;ve set up predefined automation projects that can minimize development costs, like a foundation it still can tailor solutions to your needs.\nRequest in Request ↗ we will assess your needs and develop tools specifically for you. This process requires detailed requirement weather by filing our form or engaging in direct interaction with our team.\nWe can automating a broad range of tasks from document to artistic works.\nℹ️ By choosing the appropriate level, you can achieve your goals efficiently. "},"title":"Getting Started"},"/services/automation/predefined/":{"data":{"":" ⚠️ Coming Soon. "},"title":"Predefined"},"/services/automation/request/":{"data":{"":" ℹ️ Article work in progress. ⚠️ Due to our current limitations, we will only accept the most feasible requests. For this reason, it is recommended that you engaging in direct interaction with our team first. Email | Discussion\n"},"title":"Request"},"/services/automation/request/procedures/":{"data":{"":" ℹ️ Article work in progress. Email | Discussion\n"},"title":"Procedures"},"/services/automation/request/qna/":{"data":{"":" ℹ️ Article work in progress. Email | Discussion\n"},"title":"QnA"},"/services/video_game/":{"data":{"":"A type of software program that involves interaction with user to complete objectives or challenges, often with visual, rules, and audio elements. it has various genres and styles for entertainment, engagement, or educational purpose.\nℹ️ Article work in progress. ⚠️ Due to our current limitations, we will only accept the most feasible requests. For this reason, it is recommended that you engaging in direct interaction with our team first. Email | Discussion\n"},"title":"Video Game"}}